balazsgrill/modembed/res/Devices/dsPIC30/DSPIC30F6011A.PIC
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="C1RX0B4" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuu" edc:name="C1RX0B4" edc:nzwidth="0x10" edc:por="xxxxxxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXB0D6" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="TXB0D6" edc:nzwidth="0x8"/>
              <edc:SFRFieldDef edc:cname="TXB0D7" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="TXB0D7" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TXB0D60" edc:desc="" edc:mask="0x1" edc:name="TXB0D60" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D61" edc:desc="" edc:mask="0x1" edc:name="TXB0D61" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D62" edc:desc="" edc:mask="0x1" edc:name="TXB0D62" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D63" edc:desc="" edc:mask="0x1" edc:name="TXB0D63" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D64" edc:desc="" edc:mask="0x1" edc:name="TXB0D64" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D65" edc:desc="" edc:mask="0x1" edc:name="TXB0D65" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D66" edc:desc="" edc:mask="0x1" edc:name="TXB0D66" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D67" edc:desc="" edc:mask="0x1" edc:name="TXB0D67" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D70" edc:desc="" edc:mask="0x1" edc:name="TXB0D70" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D71" edc:desc="" edc:mask="0x1" edc:name="TXB0D71" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D72" edc:desc="" edc:mask="0x1" edc:name="TXB0D72" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D73" edc:desc="" edc:mask="0x1" edc:name="TXB0D73" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D74" edc:desc="" edc:mask="0x1" edc:name="TXB0D74" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D75" edc:desc="" edc:mask="0x1" edc:name="TXB0D75" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D76" edc:desc="" edc:mask="0x1" edc:name="TXB0D76" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0D77" edc:desc="" edc:mask="0x1" edc:name="TXB0D77" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="r" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--------c---rnrr" edc:cname="C1RX0CON" edc:desc="" edc:impl="0x8f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------0---0000" edc:name="C1RX0CON" edc:nzwidth="0x10" edc:por="--------0---0000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FILHIT0" edc:desc="" edc:mask="0x1" edc:name="FILHIT0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="JTOFF" edc:desc="" edc:mask="0x1" edc:name="JTOFF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DBEN" edc:desc="" edc:mask="0x1" edc:name="DBEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXRTRRO" edc:desc="" edc:mask="0x1" edc:name="RXRTRRO" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="RXFUL" edc:desc="" edc:mask="0x1" edc:name="RXFUL" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="FILHIT" edc:desc="" edc:mask="0x1" edc:name="FILHIT" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="RXB0DBEN" edc:desc="" edc:mask="0x1" edc:name="RXB0DBEN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nrnnnnnnrrr-rrr-" edc:cname="C1CTRL" edc:desc="" edc:impl="0xffee" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000-000-" edc:name="C1CTRL" edc:nzwidth="0x10" edc:por="00000100100-000-">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ICODE" edc:desc="" edc:mask="0x7" edc:name="ICODE" edc:nzwidth="0x3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="OPMODE" edc:desc="" edc:mask="0x7" edc:name="OPMODE" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="REQOP" edc:desc="" edc:mask="0x7" edc:name="REQOP" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="CANCKS" edc:desc="" edc:mask="0x1" edc:name="CANCKS" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ABAT" edc:desc="" edc:mask="0x1" edc:name="ABAT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CANSIDL" edc:desc="" edc:mask="0x1" edc:name="CANSIDL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CANFRZ" edc:desc="" edc:mask="0x1" edc:name="CANFRZ" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CANCAP" edc:desc="" edc:mask="0x1" edc:name="CANCAP" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ICODE0" edc:desc="" edc:mask="0x1" edc:name="ICODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ICODE1" edc:desc="" edc:mask="0x1" edc:name="ICODE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ICODE2" edc:desc="" edc:mask="0x1" edc:name="ICODE2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="OPMODE0" edc:desc="" edc:mask="0x1" edc:name="OPMODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OPMODE1" edc:desc="" edc:mask="0x1" edc:name="OPMODE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OPMODE2" edc:desc="" edc:mask="0x1" edc:name="OPMODE2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="REQOP0" edc:desc="" edc:mask="0x1" edc:name="REQOP0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="REQOP1" edc:desc="" edc:mask="0x1" edc:name="REQOP1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="REQOP2" edc:desc="" edc:mask="0x1" edc:name="REQOP2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="CSIDL" edc:desc="" edc:mask="0x1" edc:name="CSIDL" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
